Tekla Open API Reference for Tekla Structures 2025
LineSegment.Equals Method (ICurve)
 Returns true if the other curve is a line segment equal to this
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Equals(
	ICurve other
)
Public Function Equals (
	other As ICurve
) As Boolean
Parameters
other
Type: Tekla.Structures.Geometry3d.ICurve
The curve to check equality against
Return Value
Type: Boolean
True if the curves are equal
Implements
IEquatable<T>.Equals(T)
See Also
Reference
LineSegment Class
Equals Overload
Tekla.Structures.Geometry3d Namespace